[
{"timestamp": "2026-02-19T02:13:10Z", "account": "Mr. Whale", "handle": "@CryptoWhale", "time_ago": "Feb", "content": " Pinned Tweet   The CEO of Barclays laughs together with Epstein that the masses are busy with bread and circuses instead of overthrowing the financial elite. ", "engagement": "❤ 0  💬 0  👁 0  🖼 2 张图片"},
{"timestamp": "2026-02-19T02:13:10Z", "account": "Mr. Whale", "handle": "@CryptoWhale", "time_ago": "3h", "content": " Mr. Whale retweeted   Numerology always matters 👀   Still waiting for the moment when paid accounts start spreading fake Epstein documents, and then US media - silent all along - jump in to “show manipulation” and claim that most of what we’ve seen from the start was fake.   The plan must be carried out - no matter who’s in command. ", "engagement": "❤ 0  💬 0  👁 0  🖼 1 张图片"},
{"timestamp": "2026-02-19T02:13:10Z", "account": "Donald J. Trump", "handle": "@realDonaldTrump", "time_ago": "3h", "content": "  In order to get elected, will start a war with Iran.   \"BREAKING: 🇺🇸 The U.S. State Department is developing an online portal that will enable people in Europe and elsewhere to see content banned by their governments, a move Washington views as a way to counter censorship. The site will be hosted at freedom(dot)gov.\"   \"2010: Sir Bani Yas. A sealed desert summit for the world’s elite - prime ministers, intelligence chiefs, royalty. No cameras. No leaks. On the VIP list: Jeffrey Epstein. Already convicted in 2008 for procuring underage girls. Security clearance? Approved. “Jeffrey, please come. You may have private time with each.” Hosted under the authority of Sheikh Abdullah bin Zayed Al Nahyan and the International Peace Institute. Vetted. Cleared. Welcomed. Not despite his past - but because of his connections. Epstein wasn’t outside the system. He was inside the room.\"   \"President Trump: \\\"Happy Black History Month, Happy Black History Year, Happy Black History Century\\\" 👀\" ", "engagement": "❤ 0  💬 0  👁 0  🖼 5 张图片"}{"timestamp": "2026-02-19T02:13:10Z", "account": "unusual_whales", "handle": "@unusual_whales", "time_ago": "Jan", "content": " Pinned Tweet   🚨BREAKING🚨 I just released the full report on Congress trading in 2025. Like every year since 2020, some politicians beat the market. Many had unusual trades. Some had huge gains. Here are the top political traders of 2025.   Goldman Sachs says it is using AI to \"limit future head count growth,\" per CNBC   \"The U.S. labor market added 130,000 jobs in January 2026, surpassing economists' expectations of 70,000. Read more:\" unusualwhales.com   \"\\\"Foreign investors are dumping both Indian stocks and sovereign debt,\\\" per Bloomberg.\" ", "engagement": "❤ 15  💬 11  👁 13  🖼 1 张图片"}